package alg_02_体系班_zcy.class09;

/**
 * @Author Wuyj
 * @DateTime 2022-09-25 13:36
 * @Version 1.0
 */
public class Code02_IsPalindrome {
    /*
    前置知识补充:

    有一个五位数:12345
    1.除法/ -> 去掉尾数(或:顺序取数)
        1)去掉最后4位数字(即取首数):12345/10000=1.××××
        2)去掉最后3位数字(即取前两位):12345/1000=12.××××
        3)去掉最后2位数字(即取前三位):12345/100=123.××××
        4)去掉最后1位数字(即取前四位): 12345/10=1234.××××

        代码实现:
        int a=12345 / 10000 ; //取最前一位/去掉后面4位:结果:a=1
        int a=12345 / 1000 ; //取最前二位/去掉后面3位:结果:a=12
        int a=12345 / 100 ;  //取最前三位/去掉后面2位:结果:a=123
        int a=12345 / 10 ;   //取最前四位/去掉后面1位:结果:a=1234
        KeyPoint 总结:y/1xxx,1后面几个0,相当于将y后几位抹去


    2.取余% -> 逆向取数
        1)取尾数:12345%10=5 
        2)取后两位:12345%100=45 
        3)取后三位:12345%1000=345 
        4)取后四位:12345%10000=2345 
        
        代码实现:
        int a=12345 % 10000 ; //取后四位:结果:a=2345
        int a=12345 % 1000 ;  //取后三位:结果:a=345
        int a=12345 % 100 ;   //取后两位:结果:a=45
        int a=12345 & 10 ;    //取后一位:结果:a=5
        KeyPoint 总结:y%1xxx,1后面几个0,相当于将y后几位保留

    3.任意单独取出一个任意位数的所有位上的数:先顺序取数(/),再逆序取数(%)
         1)取首位:
            12345/10000=1(第一位)
         2)顺序取第二位:
            12345/1000=12;12%10=2(第二位)
            先抹去后3位,再保留后面1位
         3)顺序取第三位:
            12345/100=123;123%10=3(第三位)
         4)顺序取第四位:
            12345/10=1234;1234%10=4(第四位)
         5)顺序取第五位:
            12345/1=12345;12345%10=5(第五位)
     */
    public static boolean isPalindrome(int x) {
        if (x < 0) {
            return false;
        }

        int rem = 0, result = 0;
        int target = x;
        while (target != 0) {
            rem = target % 10;
            result = result * 10 + rem;
            target /= 10;
        }
        // 不能使用target,在while循环里面,target值已经发生变化了,直接使用最初的x即可
        //return target == result;
        return result == x;
    }

    public static void main(String[] args) {
        System.out.println(isPalindrome(121));
    }
}
