package alg_02_train_dm._02_day_一维数组;

/**
 * @Author Wuyj
 * @DateTime 2023-04-17 11:44
 * @Version 1.0
 */
public class _00_Note {
    /*
        直接模拟算法 => 根据题目的要去直接模拟就可以得到题解

        昨日回顾
        1 元素作为索引 => 前提:数组元素有一定范围，且范围不能太大
        2 快慢指针
        3 对撞指针
        4 前缀和，前缀乘积 => 在一定场景下，降低时间复杂度，提高性能
                          => 一般是作为数据的预处理，基于前缀和或者前缀乘积，进行后续的操作

        今日内容
        一位数组形状  1 有序数组  1 2 3 4 5 6 7  无序 ⇋ 有序
                     2 山脉数组  1 3 6 8 7 6 2  先 ↗ 后 ↘
                     3 旋转数组  1 2 3 4 5 6 7 -> 4 5 6 7 1 2 3

        反向遍历数组
            正常思维 => 从左往右遍历数组
            逆向思维 => 从右往左遍历数组 => 有时候使得问题更容易解决

     */
}
