package alg_02_train_dm._28_day_动态规划三;

/**
 * @Author Wuyj
 * @DateTime 2023-06-10 20:05
 * @Version 1.0
 */
public class _06_Note_best_time_to_buy_and_sell_stock {
    /*

        买卖股票的最佳时机
        给定一个数组 prices，它的第 i 个元素 prices[i] 表示一支给定股票第 i 天的价格。
        prices 7 1 5 3 6 4

        
        121. 买卖股票的最佳时机
        你只能选择 某一天 买入这只股票，并选择在 未来的某一个不同的日子 卖出该股票。
        设计一个算法来计算你所能获取的最大利润。
        prices 7 1 5 3 6 4
        索引   0 1 2 3 4 5
        最大利润：6 - 1 = 5

        122. 买卖股票的最佳时机 II
        设计一个算法来计算你所能获取的最大利润。你可以尽可能地完成更多的交易（多次买卖一支股票）。
        prices 7 1 5 3 6 4
        索引   0 1 2 3 4 5
        注意：你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。


     */
}
