package alg_02_train_dm._10_day_栈和队列;

/**
 * @Author Wuyj
 * @DateTime 2023-04-24 18:09
 * @Version 1.0
 */
public class _00_Note {
    /*
        栈和队列 => 辅助查找 => 降低时间复杂度，提高性能

        1.栈和队列特点回顾
        2.各种语言中的栈怎么表达
        3.刷题：栈的特性和单调栈


       ----------------------------------------------

        栈

        栈顶
        |  |    压栈 push O(1)
        |  |    出栈 pop  O(1)
        |__|    栈的特点：先进后出
        栈底


        队列

        队尾           队首
             ---------
             ---------
        入队 → → → → → 出队
            queue 队列

        入队 offer O(1)
        出队 poll O(1)
        队列的特点：先进先出


        队列

        队尾           队首 (栈顶)

        出队 ←          出队 →  出栈 pop
             ---------
             ---------
        入队 →          入队 ←  压栈 push

           deque 双端队列


        双端队列 => 实现队列 => 队尾入队，队首出队

        双端队列 => 实现栈 => 队首作为栈顶，出栈和压栈






     */
}
