package alg_01_ds_dm._01_line._05_algo._03_sort_二刷.train;

/**
 * @Author Wuyj
 * @DateTime 2023-05-12 19:55
 * @Version 1.0
 */
public class _06_Note_刷题技巧 {


    /*
        题不要一上来就直接干，先看题，明白题说的什么意思，
        然后想一下用什么现成的算法和数据结构可以快速解决

        如果还是无从下手，建议先去看视频，不要直接翻评论或官方代码实现，
        看完视频，自己在idea中模拟敲几遍代码

        如果跑通了，先别急着上 leetcode 黏贴，而是再回顾一下要点，然后确定自己完全懂了后，
        在leetcode中手敲，注意是手敲下来！！！ 目前我就是采用的这种方法，虽然慢，但是可以维持一周忘不掉它

        如果要想长期不忘，只能隔段时间就 review 一下了，就算是大牛，知道方法，长时间不碰，
        也不可能保证一次到位把代码敲完一遍过！！！
     */
}
