package alg_01_ds_dm._01_line._05_algo._01_twopoint;

/**
 * @Author Wuyj
 * @DateTime 2023-05-05 16:09
 * @Version 1.0
 */
public class _03_Note {
    /*
        双指针，记录更多信息
        fast 指针遍历数组中元素，slow 记录其他信息
            1.降低空间复杂度
            2.提升性能
            3.降低时间复杂度

        算法解题思路
                                      ↗ 时间复杂度  ↘
        算法题 -> 暴力 / 最简单的解法                   最优解
                                      ↘ 空间复杂度  ↗

        面对一道算法题，不要想着一步写出最优解(除非你很强！)

        先将问题解出来再说，后续再去想着优化！


     */
}
