package alg_02_train_dm._16_day_二叉树一;

/**
 * @Author Wuyj
 * @DateTime 2023-04-01 12:00
 * @Version 1.0
 */
public class _00_Note {
    /*
                           1 前序遍历 √
        深度优先搜索（DFS） 2 中序遍历
        深度优先遍历        3 后序遍历 √

                前序遍历、中序遍历、后序遍历遍历的时候，从根节点开始
                一直到最深的左节点，然后开始回溯选择其他节点

                DFS 根节点的右子节点先到后处理，类似先进后出，通过栈实现

        广度优先搜索（BFS） 4 层序遍历

                每次遍历一个节点的所有子节点，每次遍历一层所有的子节点
                BFS 一层一层处理，先到先处理，通过队列实现


        总结：二叉树问题一般都可以归结 DFS 和 BFS 来解决

     */
}
