package alg_03_high_frequency._02_leetcode_top_100;

/**
 * @Author Wuyj
 * @DateTime 2023-09-21 19:47
 * @Version 1.0
 */
public class leetcode_top_100 {
   /*

KeyPoint 哈希

	两数之和
	简单

	字母异位词分组
	中等

	最长连续序列
	中等

======================

KeyPoint 双指针

	移动零
	简单

	盛最多水的容器
	中等

	三数之和
	中等

	接雨水
	困难

======================

KeyPoint 滑动窗口

	无重复字符的最长子串
	中等

	找到字符串中所有字母异位词
	中等

======================

KeyPoint 子串

	和为 K 的子数组
	中等

	滑动窗口最大值
	困难

	最小覆盖子串
	困难

======================

KeyPoint 普通数组

	最大子数组和
	中等

	56 合并区间 => 9.22
	中等

	轮转数组
	中等

	除自身以外数组的乘积
	中等

	缺失的第一个正数
	困难

======================

KeyPoint 矩阵

	矩阵置零
	中等

	螺旋矩阵
	中等

	旋转图像
	中等

	搜索二维矩阵 II
	中等

======================

KeyPoint 链表

    相交链表
    简单

    反转链表
    简单

    回文链表
    简单

    环形链表
    简单

    环形链表 II
    中等

    合并两个有序链表 => 9.22
    简单

    两数相加
    中等

    删除链表的倒数第 N 个结点  => 9.22
    中等

    两两交换链表中的节点
    中等

    K 个一组翻转链表
    困难

    随机链表的复制
    中等

    排序链表
    中等

    合并 K 个升序链表  => 9.22
    困难

    LRU 缓存
    中等

======================

KeyPoint 二叉树

	二叉树的中序遍历
	简单

	二叉树的最大深度
	简单

	翻转二叉树
	简单

	对称二叉树
	简单

	二叉树的直径
	简单

	二叉树的层序遍历
	中等

	将有序数组转换为二叉搜索树
	简单

	验证二叉搜索树
	中等

	二叉搜索树中第K小的元素
	中等

	二叉树的右视图
	中等

	二叉树展开为链表
	中等

	从前序与中序遍历序列构造二叉树
	中等

	路径总和 III
	中等

	二叉树的最近公共祖先
	中等

	二叉树中的最大路径和
	困难

======================

KeyPoint 图论

	200 岛屿数量 => 9.22
	中等

	腐烂的橘子
	中等

	课程表
	中等

	实现 Trie (前缀树)
	中等

======================

KeyPoint 回溯

	46 全排列 => 9.22
	中等

	78 子集 => 9.22
	中等

	17 电话号码的字母组合 => 9.22
	中等

	39 组合总和 => 9.22
	中等

	括号生成
	中等

	单词搜索
	中等

	分割回文串
	中等

	N 皇后
	困难

======================

KeyPoint 二分查找

	搜索插入位置
	简单

	搜索二维矩阵
	中等

	在排序数组中查找元素的第一个和最后一个位置
	中等

	搜索旋转排序数组
	中等

	寻找旋转排序数组中的最小值
	中等

	寻找两个正序数组的中位数
	困难

======================

KeyPoint 栈

	有效的括号
	简单

	最小栈
	中等

	字符串解码
	中等

	每日温度
	中等

	柱状图中最大的矩形
	困难

======================

KeyPoint 堆

	数组中的第K个最大元素
	中等

	前 K 个高频元素
	中等

	数据流的中位数
	困难

======================

KeyPoint 贪心算法

	买卖股票的最佳时机
	简单

	跳跃游戏
	中等

	跳跃游戏 II
	中等

	划分字母区间
	中等

======================

KeyPoint 动态规划

	爬楼梯 => 9.22
	简单

	杨辉三角
	简单

	打家劫舍
	中等

	完全平方数
	中等

	零钱兑换 => 9.22
	中等

	单词拆分
	中等

	最长递增子序列
	中等

	乘积最大子数组
	中等

	分割等和子集
	中等

	最长有效括号
	困难

======================

KeyPoint 多维动态规划

	不同路径
	中等

	最小路径和 => 9.22
	中等

	最长回文子串 => 9.22
	中等

	最长公共子序列 => 9.22
	中等

	编辑距离 => 9.22
	困难

======================

KeyPoint 技巧

	只出现一次的数字
	简单

	多数元素
	简单

	75 颜色分类 => 9.22
	中等

	下一个排列
	中等

	寻找重复数
	中等

======================

KeyPoint 排序

    归并 => 9.22

    快排 => 9.22


    */



}
