package alg_03_leetcode_top_zcy.class_09;

/**
 * @Author Wuyj
 * @DateTime 2023-03-02 11:14
 * @Version 1.0
 */
public class Problem_0073_Note_TwoDimensionalArray {

     /*
        KeyPoint 二维数组行和列
        明确二维矩阵的行和列 Matrix 3*4
         {{1,2,3,4},
          {5,6,7,8},
          {9,10,11,12}}
        3表示:从上到下有3个一维数组
        4表示:每个一维数组有4个元素
        => i=matrix.length-1定位最后一行
        => j从1~matrix[0].length变里数组中所有元素
        ----------------------------------------
         3表示行数,4表示列数
         int[][] arr = new int[3][4];
         int[][] arr1 = {
                {1, 2, 3, 4},
                {5, 6, 7, 8},
                {9, 10, 11, 12}
         };
         表格上显示 => 行(水平) 列(垂直)
        ----------------------------------------
         坐标(l,r)与行列关系
         同一行l不变,l-1上一行,l+1下一行,上下关系
         同一列r不变,r-1前一列,r+1后一列,左右关系


      */
}
